Revit 2026 API

# StructuralConnectionHandlerRemoveReferences Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveReferences(
	IList<Reference> picks
)
```
```vb
Public Sub RemoveReferences (
	picks As IList(Of Reference)
)
```
```cpp
public:
void RemoveReferences(
	IList<Reference^>^ picks
)
```
```fsharp
member RemoveReferences :
        picks : IList<Reference> -> unit
```

#### Parameters

picks IListReference

#### Reference

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace